app/controllers/members_controller.rb

  def index
    if params[:query].present?
      @member = Member.search(params[:query], page: params[:page])
---
SELECT "members".* FROM "members"

  def edit
    @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]

  def show
    @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 2]]

  def create
    @member = Member.new(member_params)
    @member.save
---
INSERT INTO "members" ("first_name", "last_name", "email", "status", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["first_name", "a"], ["last_name", "a"], ["email", "a"], ["status", "R"], ["created_at", "2015-10-19 19:09:59.313321"], ["updated_at", "2015-10-19 19:09:59.313321"]]

  def destroy
    @member = Member.find(params[:id])
    @member.destroy
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 1]]